InformationRegisters/МИКО_опИндексНомераТелефоновБуквенные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МИКО_опИндексНомераТелефоновБуквенные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТелефонаСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерТелефонаИндекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СсылкаНаКлиента</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МИКО_опИндексНомераТелефонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МИКО_опИндексНомераТелефонов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерТелефонаСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерТелефонаИндекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СсылкаНаКлиента</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ChartsOfCharacteristicTypes/МИКО_стНастройкиТелефонии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>МИКО_стНастройкиТелефонии</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>32</v8:Digits>
					<v8:FractionDigits>2</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>500</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаЗначений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МИКО_стУчетныеЗаписиАТС</v8:Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>did</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>accountcode</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

CommonModules/МИКО_стОбработкаКонтактнойИнформации/Ext/Module.bsl
// #Область СлужебныеПроцедурыИФункции
// ---------------------------------------------------- //.
// НАПОЛНЕНИЕ ТЕЛЕФОННОЙ КНИГИ.
// ---------------------------------------------------- //.

// Наполнение телефонной книги (РегистрСведений.МИКО_ТелефонныйСправочник).
// 
Процедура ОбработатьТелефоныВ_КИ_Справочников() Экспорт
	МассивТипов = ПолучитьИменаМетаданныхС_КИ();
	// обходим справочники
	Для каждого Источник Из МассивТипов Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТекущийОбъект.Ссылка
			|ИЗ
			|	"+Источник.Значение+"."+Источник.Ключ+" КАК ТекущийОбъект";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Попытка
			    ИсточникОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Исключение
				МИКО_стОбщегоНазначенияСервер.СообщитьПользователю("Не вышло получить объект " + Выборка.Ссылка);
				Продолжить;
			КонецПопытки;
			КИ_БылаИзменена = Ложь;
			// Обходим контактную информацию
			Для каждого Контакт Из ИсточникОбъект.КонтактнаяИнформация Цикл
				Если Найти(НРег(""+Контакт.Вид), "skype")>0  Тогда
				  	Продолжить;
				КонецЕсли; 
				
				// только телефоны
				Если Контакт.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
					НомерТелефонаБезКодов =  МИКО_опЗаписьКИ.УбратьИзСтрокиТелефонаВсеБуквы(Контакт.НомерТелефонаБезКодов);
					НомерТелефона		  =  МИКО_опЗаписьКИ.УбратьИзСтрокиТелефонаВсеБуквы(Контакт.НомерТелефона);
					Если НомерТелефонаБезКодов = Контакт.НомерТелефонаБезКодов
						 И НомерТелефона = Контакт.НомерТелефона Тогда
						// не требуется запись 
						Продолжить;	
					КонецЕсли; 
					КИ_БылаИзменена = Истина;
					Контакт.НомерТелефонаБезКодов = НомерТелефонаБезКодов;
					Контакт.НомерТелефона		  = НомерТелефона;
				КонецЕсли; // Проверка на тип контактной информации
			КонецЦикла; // Обход контактной информации     			
			
			Если КИ_БылаИзменена=Ложь Тогда
				ИсточникОбъект = Неопределено;
				Продолжить;
			КонецЕсли; 
			ИсточникОбъект.ДополнительныеСвойства.Вставить("МИКО_НеОбновлятьИсторию",Истина);
			Попытка                                              
			    ИсточникОбъект.Записать();                                 
			Исключение
				МИКО_стОбщегоНазначенияСервер.СообщитьПользователю("Не вышло записать объект " + Выборка.Ссылка);
				Продолжить;
			КонецПопытки;
		КонецЦикла;
	КонецЦикла; 
	
КонецПроцедуры

// Производит очистку и заполнение регистра "МИКО_ТелефонныйСправочник".
// 
Процедура ПерезаполнитьТелефоннуюКнигу(КолЦифр=Неопределено) Экспорт
	
	МассивТипов = ПолучитьИменаМетаданныхС_КИ();
	ТекстЗапроса = "";
	Если МассивТипов.Количество()<>0 Тогда
		Для каждого ТекущийТип Из МассивТипов Цикл
		 	Если НЕ ТекстЗапроса = "" Тогда
				ТекстЗапроса = ТекстЗапроса +
							"
							|
							|ОБЪЕДИНИТЬ ВСЕ
							| ";
							
			КонецЕсли; 
		    ТекстЗапроса = ТекстЗапроса + 	
							"ВЫБРАТЬ
							|	"+ТекущийТип.Значение+"_"+ТекущийТип.Ключ+".Ссылка
							|ИЗ
							|	"+ТекущийТип.Значение+"."+ТекущийТип.Ключ+" КАК "+ТекущийТип.Значение+"_"+ТекущийТип.Ключ+"
							| ";
		КонецЦикла; 
		Запрос = Новый Запрос(ТекстЗапроса);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МИКО_опЗаписьКИ.СправочникСКонтактамиПриЗаписи(Выборка.Ссылка, Ложь);
		КонецЦикла;
	КонецЕсли;
	
	Если Метаданные.РегистрыСведений.Найти("КонтактнаяИнформация") = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьРегистрИндексНомера(КолЦифр);
	
КонецПроцедуры

// Анализирует метаданные. Возвращает соответствие. Объекты с контактной информацией.
// 
Функция ПолучитьИменаМетаданныхС_КИ()

	// 1. Получим список типов объектов с контактной информацией
	МассивТипов = Новый Соответствие;
	Для каждого ТекущийТип Из Метаданные.Документы Цикл
		Если ТекущийТип.ТабличныеЧасти.Найти("КонтактнаяИнформация") = Неопределено Тогда
		 	Продолжить;
		КонецЕсли; 
	   	МассивТипов.Вставить(ТекущийТип.Имя, "Документ");
	КонецЦикла;
	
	// 2. Получим список типов объектов справочников
	Для каждого ТекущийТип Из Метаданные.Справочники Цикл
		Если ТекущийТип.ТабличныеЧасти.Найти("КонтактнаяИнформация") = Неопределено Тогда
		 	Продолжить;
		КонецЕсли; 
	   	МассивТипов.Вставить(ТекущийТип.Имя, "Справочник");
	КонецЦикла; 
	
	Возврат МассивТипов;
КонецФункции // ПолучитьИменаМетаданныхС_КИ()

// Возарщает массив контактов партнера.
// 
Функция ПолучитьКонтактыПоПартнеру(Партнер) Экспорт
	
	Если НЕ Метаданные.Справочники.Найти("Партнеры") = Неопределено 
		И НЕ Метаданные.Справочники.Найти("КонтактныеЛицаПартнеров") = Неопределено 
		 И ТипЗнч(Партнер) = Тип("СправочникСсылка.Партнеры") Тогда
		 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Партнеры.Ссылка
			|ПОМЕСТИТЬ ПартнерыВИерархии
			|ИЗ
			|	Справочник.Партнеры КАК Партнеры
			|ГДЕ
			|	Партнеры.Ссылка В ИЕРАРХИИ(&Ссылка)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КонтактныеЛицаПартнеров.Ссылка
			|ИЗ
			|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
			|ГДЕ
			|	КонтактныеЛицаПартнеров.Владелец В
			|			(ВЫБРАТЬ
			|				ПартнерыВИерархии.Ссылка
			|			ИЗ
			|				ПартнерыВИерархии КАК ПартнерыВИерархии)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПартнерыВИерархии.Ссылка
			|ИЗ
			|	ПартнерыВИерархии КАК ПартнерыВИерархии";
		Запрос.УстановитьПараметр("Ссылка",Партнер);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	ИначеЕсли НЕ Метаданные.Справочники.Найти("Контрагенты") = Неопределено 
		И НЕ Метаданные.Справочники.Найти("КонтактныеЛицаКонтрагентов") = Неопределено 
		 И ТипЗнч(Партнер) = Тип("СправочникСсылка.Контрагенты") Тогда
		 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Контрагенты.Ссылка
			|ПОМЕСТИТЬ КонтрагентыВИерархии
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.Ссылка В ИЕРАРХИИ(&Ссылка)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КонтактныеЛицаКонтрагентов.Ссылка
			|ИЗ
			|	Справочник.КонтактныеЛицаКонтрагентов КАК КонтактныеЛицаКонтрагентов
			|ГДЕ
			|	КонтактныеЛицаКонтрагентов.Владелец В
			|			(ВЫБРАТЬ
			|				КонтрагентыВИерархии.Ссылка
			|			ИЗ
			|				КонтрагентыВИерархии КАК КонтрагентыВИерархии)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	КонтрагентыВИерархии.Ссылка
			|ИЗ
			|	КонтрагентыВИерархии КАК КонтрагентыВИерархии";
			
		Запрос.УстановитьПараметр("Ссылка",Партнер);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	ИначеЕсли НЕ Метаданные.Справочники.Найти("Корреспонденты") = Неопределено 
		И НЕ Метаданные.Справочники.Найти("КонтактныеЛица") = Неопределено 
		 И ТипЗнч(Партнер) = Тип("СправочникСсылка.Корреспонденты") Тогда
		 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Контрагенты.Ссылка
			|ПОМЕСТИТЬ КонтрагентыВИерархии
			|ИЗ
			|	Справочник.Корреспонденты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.Ссылка В ИЕРАРХИИ(&Ссылка)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КонтактныеЛицаКонтрагентов.Ссылка
			|ИЗ
			|	Справочник.КонтактныеЛица КАК КонтактныеЛицаКонтрагентов
			|ГДЕ
			|	КонтактныеЛицаКонтрагентов.Владелец В
			|			(ВЫБРАТЬ
			|				КонтрагентыВИерархии.Ссылка
			|			ИЗ
			|				КонтрагентыВИерархии КАК КонтрагентыВИерархии)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	КонтрагентыВИерархии.Ссылка
			|ИЗ
			|	КонтрагентыВИерархии КАК КонтрагентыВИерархии";
			
		Запрос.УстановитьПараметр("Ссылка",Партнер);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	ИначеЕсли Партнер <> Неопределено И Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Партнер)) И Партнер.ЭтоГруппа Тогда
		
		РезультатЗапроса = Партнер;
		
	Иначе
		РезультатЗапроса = Новый Массив;
		РезультатЗапроса.Добавить(Партнер);
	КонецЕсли; 
	Возврат РезультатЗапроса;
КонецФункции

// Обновление КИ в документах истории звонков для "Обычного приложения".
// 
Процедура ОбновитьКИВДокументахИстории(Знач СтруктураПараметров = Неопределено) Экспорт
    Если НЕ МИКО_опЗаписьКИ.ИспользоватьМодульСтатистики() Тогда Возврат; КонецЕсли; 
	ОбновитьКИВДокументах();
КонецПроцедуры

// Обновление КИ в документах истории звонков для "Обычного приложения".
// 
Процедура ОбновитьКИВДокументах(Узел=Неопределено, КоличествоМесяцев=2)
	
	КоличествоХранимыхЦифрТелефона = МИКО_стОбщегоНазначенияСерверПовторный.КоличествоХранимыхЦифрТелефона();
	
	Если Узел=Неопределено Тогда
		Узел = ПланыОбмена.МИКО_стОбновлениеКИ.НайтиПоКоду("КИ");
		Если НЕ ЗначениеЗаполнено(Узел) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	МИКО_опИндексНомераТелефоновБуквенныеИзменения.НомерТелефонаИндекс КАК НомерТелефонаИндекс,
	               |	МИКО_опИндексНомераТелефоновБуквенныеИзменения.СсылкаНаКлиента КАК СсылкаНаКлиента
	               |ПОМЕСТИТЬ ВТИзмененияБуквенные
	               |ИЗ
	               |	РегистрСведений.МИКО_опИндексНомераТелефоновБуквенные.Изменения КАК МИКО_опИндексНомераТелефоновБуквенныеИзменения
	               |ГДЕ
	               |	МИКО_опИндексНомераТелефоновБуквенныеИзменения.Узел = &Узел
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	СсылкаНаКлиента,
	               |	НомерТелефонаИндекс
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МИКО_опИндексНомераТелефоновИзменения.НомерТелефонаИндекс КАК НомерТелефонаИндекс,
	               |	МИКО_опИндексНомераТелефоновИзменения.СсылкаНаКлиента КАК СсылкаНаКлиента
	               |ПОМЕСТИТЬ ВТИзмененияЧисловые
	               |ИЗ
	               |	РегистрСведений.МИКО_опИндексНомераТелефонов.Изменения КАК МИКО_опИндексНомераТелефоновИзменения
	               |ГДЕ
	               |	МИКО_опИндексНомераТелефоновИзменения.Узел = &Узел
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	НомерТелефонаИндекс,
	               |	СсылкаНаКлиента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТИзмененияБуквенные.СсылкаНаКлиента КАК СсылкаНаКлиента,
	               |	ВТИзмененияБуквенные.НомерТелефонаИндекс,
	               |	МИКО_опИндексНомераТелефоновБуквенные.Регион,
	               |	МИКО_опИндексНомераТелефоновБуквенные.НомерТелефонаСтрокой,
	               |	ИСТИНА КАК Буквенные
	               |ИЗ
	               |	ВТИзмененияБуквенные КАК ВТИзмененияБуквенные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МИКО_опИндексНомераТелефоновБуквенные КАК МИКО_опИндексНомераТелефоновБуквенные
	               |		ПО ВТИзмененияБуквенные.СсылкаНаКлиента = МИКО_опИндексНомераТелефоновБуквенные.СсылкаНаКлиента
	               |			И ВТИзмененияБуквенные.НомерТелефонаИндекс = МИКО_опИндексНомераТелефоновБуквенные.НомерТелефонаИндекс
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТИзмененияЧисловые.СсылкаНаКлиента,
	               |	ВТИзмененияЧисловые.НомерТелефонаИндекс,
	               |	МИКО_опИндексНомераТелефонов.Регион,
	               |	МИКО_опИндексНомераТелефонов.НомерТелефонаСтрокой,
	               |	ЛОЖЬ
	               |ИЗ
	               |	ВТИзмененияЧисловые КАК ВТИзмененияЧисловые
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МИКО_опИндексНомераТелефонов КАК МИКО_опИндексНомераТелефонов
	               |		ПО ВТИзмененияЧисловые.СсылкаНаКлиента = МИКО_опИндексНомераТелефонов.СсылкаНаКлиента
	               |			И ВТИзмененияЧисловые.НомерТелефонаИндекс = МИКО_опИндексНомераТелефонов.НомерТелефонаИндекс
	               |ИТОГИ ПО
	               |	СсылкаНаКлиента";
	
	Запрос.УстановитьПараметр("Узел", Узел);

	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаОбъект = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	МВТ = Неопределено;
	Пока ВыборкаОбъект.Следующий() Цикл
		Буквенные = Новый Массив; Числовые  = Новый Массив;
		Выборка = ВыборкаОбъект.Выбрать();

		Контакт = ВыборкаОбъект.СсылкаНаКлиента;
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.НомерТелефонаСтрокой = NULL Тогда 
				
				Если Выборка.Буквенные Тогда
					НаборКУдалению = РегистрыСведений.МИКО_опИндексНомераТелефоновБуквенные.СоздатьНаборЗаписей();
				Иначе
					НаборКУдалению = РегистрыСведений.МИКО_опИндексНомераТелефонов.СоздатьНаборЗаписей();
				КонецЕсли; 
				
				НаборКУдалению.Отбор.СсылкаНаКлиента.Установить(Контакт);
				НаборКУдалению.Отбор.НомерТелефонаИндекс.Установить(Выборка.НомерТелефонаИндекс);
				
				Попытка
					НаборКУдалению.Записать(Истина);
				Исключение
				КонецПопытки;
				
				Продолжить;
				
			КонецЕсли;
			
			Если Выборка.Буквенные Тогда
				Буквенные.Добавить(Выборка.НомерТелефонаИндекс);
			Иначе
				Числовые.Добавить(Выборка.НомерТелефонаИндекс);
			КонецЕсли; 
		КонецЦикла;
		
		Если Буквенные.Количество() = 0 И Числовые.Количество() = 0  Тогда
		     Продолжить;
		КонецЕсли; 
		// обновление контактов в документах истории звонков
		ОбновитьКонтактВИсторииЗвонков(Контакт, Буквенные, Числовые, МВТ, КоличествоМесяцев);
	КонецЦикла;
	// очищаем регистрацию в плане обмена после обработки
	ПланыОбмена.УдалитьРегистрациюИзменений(Узел);	
	
КонецПроцедуры

// Обновление КИ в документах истории звонков для "Обычного приложения".
// 
Процедура ОбновитьКИВДокументахИстории12м(Знач СтруктураПараметров = Неопределено) Экспорт
    Если НЕ МИКО_опЗаписьКИ.ИспользоватьМодульСтатистики() Тогда Возврат; КонецЕсли; 
	
	КоличествоХранимыхЦифрТелефона = МИКО_стОбщегоНазначенияСерверПовторный.КоличествоХранимыхЦифрТелефона();
	
	Узел = ПланыОбмена.МИКО_стОбновлениеКИ_Дополнительный.НайтиПоКоду("КИ");
	Если НЕ ЗначениеЗаполнено(Узел) Тогда
		Возврат;
	КонецЕсли;
	ОбновитьКИВДокументах(Узел, 12);
	
КонецПроцедуры

// Заполнение регистра "МИКО_опИндексНомераТелефоновБуквенные" и "МИКО_опИндексНомераТелефонов".
// По этому регистру производится поиск клиента по номеру телефона.
Процедура ЗаполнитьРегистрИндексНомера(КоличествоХранимыхЦифрТелефона) Экспорт
	Если НЕ ЗначениеЗаполнено(КоличествоХранимыхЦифрТелефона) Тогда
		КоличествоХранимыхЦифрТелефона = МИКО_стОбщегоНазначенияСерверПовторный.КоличествоХранимыхЦифрТелефона();
	КонецЕсли; 
	// Сформируем выборку номеров.
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Объект КАК Объект,
	               |	КонтактнаяИнформация.Представление,
	               |	КонтактнаяИнформация.Поле1,
	               |	КонтактнаяИнформация.Поле2,
	               |	КонтактнаяИнформация.Поле3,
	               |	КонтактнаяИнформация.Поле4
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	               |ИТОГИ ПО
	               |	Объект";
	
				   
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаОбъект = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);			   
				   
	Пока ВыборкаОбъект.Следующий() Цикл
		
		Буквенные = Новый Массив; Числовые  = Новый Массив;
		Выборка = ВыборкаОбъект.Выбрать();

		ОбъектКИ = ВыборкаОбъект.Объект;
		
		Пока Выборка.Следующий() Цикл
			
			Представление = ""+Выборка.Поле1+Выборка.Поле2+Выборка.Поле3;
			Если ЗначениеЗаполнено(Выборка.Поле4) И НЕ ЗначениеЗаполнено(Представление) Тогда
				НомерТелефона = "" + Выборка.Поле4;
			Иначе
				НомерТелефона = "" + Выборка.Поле1 + Выборка.Поле2 + Выборка.Поле3;
			КонецЕсли;
			
			// Наполним массивы номеров для обновления информации в истории звонков.
			Если НЕ ЗначениеЗаполнено(НомерТелефона) Тогда
				НомерТелефона = МИКО_опЗаписьКИ.УбратьИзНомераТелефонаВсеПрефиксы(Представление, """' /*+=\,!;%:?()");
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НомерТелефона) Тогда
				Продолжить;
			КонецЕсли; 

			Если МИКО_опЗаписьКИ.ЭтоЧисловойНомер(НомерТелефона) Тогда
				НомерТелефона = МИКО_опЗаписьКИ.УбратьИзНомераТелефонаВсеПрефиксы(НомерТелефона);
				Если Числовые.Найти(НомерТелефона)=Неопределено Тогда
					Числовые.Добавить(НомерТелефона);
				КонецЕсли; 
			ИначеЕсли МИКО_опЗаписьКИ.ВСловеТолькоЛатиница(НомерТелефона) Тогда
				// Это скайп
				Если Буквенные.Найти(НомерТелефона)=Неопределено Тогда
					Буквенные.Добавить(НомерТелефона);
				КонецЕсли; 
			Иначе
				Продолжить;
			КонецЕсли; 	
			
		КонецЦикла;
		
		Если Буквенные.Количество() = 0 И Числовые.Количество() = 0  Тогда
		     Продолжить;
		КонецЕсли; 
		
		НаборЗаписей = РегистрыСведений.МИКО_опИндексНомераТелефонов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СсылкаНаКлиента.Установить(ОбъектКИ);

		НаборЗаписейБуквенные = РегистрыСведений.МИКО_опИндексНомераТелефоновБуквенные.СоздатьНаборЗаписей();
		НаборЗаписейБуквенные.Отбор.СсылкаНаКлиента.Установить(ОбъектКИ);
			
		Если Числовые.Количество()>0 Тогда
			Для каждого текНомер Из Числовые Цикл
			 	новЗапись = НаборЗаписей.Добавить();
				новЗапись.НомерТелефонаИндекс = МИКО_опЗаписьКИ.ПреобразоватьНомерДляСохранения(текНомер, КоличествоХранимыхЦифрТелефона);
			    новЗапись.СсылкаНаКлиента 	  = ОбъектКИ;
			    новЗапись.НомерТелефонаСтрокой= МИКО_опЗаписьКИ.УбратьИзСтрокиТелефонаВсеБуквы(текНомер);
			КонецЦикла; 
		КонецЕсли; 
		
		Если Буквенные.Количество()>0 Тогда
			Для каждого текНомер Из Буквенные Цикл
			 	новЗапись = НаборЗаписейБуквенные.Добавить();
				новЗапись.НомерТелефонаИндекс 	= СтрЗаменить(текНомер," ","");
			    новЗапись.СсылкаНаКлиента 		= ОбъектКИ;
			    новЗапись.НомерТелефонаСтрокой 	= СтрЗаменить(текНомер," ","");
			КонецЦикла; 
		КонецЕсли; 
		
		Попытка
		НаборЗаписей.Записать();                                   
		Исключение
		КонецПопытки; 
		
		Попытка
		НаборЗаписейБуквенные.Записать();                                   
		Исключение
		КонецПопытки; 
		
	КонецЦикла; 
	
КонецПроцедуры                                                            

// Десериализует представление XML контактной информации.
// Параметры 
//   ЗначенияПолей  <Строка> - XML представление контактной информации.
//   СтруктураНомера - комплексный тип: имеет свойство "Телефон" - содержит номер телефона.
// Возвращаемое значение
//   XDTO пакет.
//
Функция КонтактнаяИнформацияИзXML(Знач ЗначенияПолей, Знач Представление) Экспорт
    пВерсияБиблиотекиБСП = Вычислить("СтандартныеПодсистемыСервер.ВерсияБиблиотеки()");
	
	длВерсияБиблиотекиБСП = Лев(пВерсияБиблиотекиБСП,5);
	Если длВерсияБиблиотекиБСП <= "2.2.3" Тогда
		врВыражение = "КонтактнаяИнформацияСлужебный.ДесериализацияТелефона(ЗначенияПолей, Представление, Перечисления.ТипыКонтактнойИнформации.Телефон)";
	Иначе	
		РезультатыЧтения = Неопределено;
		врВыражение = "УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияИзXML(ЗначенияПолей, Перечисления.ТипыКонтактнойИнформации.Телефон, РезультатыЧтения)";
	КонецЕсли; 
	РедактируемаяИнформация = Вычислить(врВыражение);	
	
	Возврат РедактируемаяИнформация;
КонецФункции // КонтактнаяИнформацияИзXML()

// ---------------------------------------------------- //.
// ОБРАБОТКА ПЕРЕМЕННЫХ ТИПА "СТРОКА".
// ---------------------------------------------------- //.

// Определяет, кому принадлежит номер телефона.
// Параметры:
// 	 МассивНомеров - тип строка / массив строк, номера для сопоставления.
// Возвращаемое значение:
//   Тип "ТаблицаЗначений" с колонками:
//   "Объект" (ссылка на владельца) / "НомерТелефона" (строка) / "НомерТелефонаЧислом" (число).
Функция ОпределитьКонтактПоНомеруТелефона(Знач МассивНомеров) Экспорт 
	Если ТипЗнч(МассивНомеров) = Тип("Строка") Тогда
		Номер = МассивНомеров;
		МассивНомеров = Новый Массив;
		МассивНомеров.Добавить(Номер);
	ИначеЕсли ТипЗнч(МассивНомеров) = Тип("Массив") Тогда 	
		// тут все ок	
	Иначе 
		Возврат Неопределено;
	КонецЕсли; 
	
	// 1. Определим тип номера 
	Буквенные = Новый Массив;
	Числовые  = Новый Массив;
	
	КоличествоХранимыхЦифрТелефона = МИКО_стОбщегоНазначенияСерверПовторный.КоличествоХранимыхЦифрТелефона();
	
	Для каждого ТекНомер Из МассивНомеров Цикл
		Если НЕ ЗначениеЗаполнено(ТекНомер) Тогда
			Продолжить;
		КонецЕсли; 
		Если МИКО_опЗаписьКИ.ЭтоЧисловойНомер(ТекНомер) Тогда
			НомерЧислом = МИКО_опЗаписьКИ.ПреобразоватьНомерДляСохранения(ТекНомер, КоличествоХранимыхЦифрТелефона);
			Если НомерЧислом > 0 Тогда
				Числовые.Добавить(НомерЧислом);
			КонецЕсли; 
		ИначеЕсли МИКО_опЗаписьКИ.ВСловеТолькоЛатиница(ТекНомер) Тогда
			// Это скайп
			Буквенные.Добавить(ТекНомер);
		Иначе
			Продолжить;
		КонецЕсли; 	
	КонецЦикла; 
	// 2.1. Сформируем запрос по номерам буквенным.
	// 2.2. Сформируем запрос по номерам числовым.
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	//ПолеПриоритет//
		|	МИКО_опИндексНомераТелефонов.СсылкаНаКлиента КАК Объект,
		|	МИКО_опИндексНомераТелефонов.НомерТелефонаСтрокой КАК НомерТелефона,
		|	МИКО_опИндексНомераТелефонов.НомерТелефонаИндекс КАК НомерТелефонаЧислом
		|ИЗ
		|	РегистрСведений.МИКО_опИндексНомераТелефонов КАК МИКО_опИндексНомераТелефонов
		|ГДЕ
		|	МИКО_опИндексНомераТелефонов.НомерТелефонаИндекс В(&ЧисловыеНомера)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	//ПолеПриоритетБуквенные//
		|	МИКО_опИндексНомераТелефоновБуквенные.СсылкаНаКлиента,
		|	МИКО_опИндексНомераТелефоновБуквенные.НомерТелефонаСтрокой,
		|	0
		|ИЗ
		|	РегистрСведений.МИКО_опИндексНомераТелефоновБуквенные КАК МИКО_опИндексНомераТелефоновБуквенные
		|ГДЕ
		|	МИКО_опИндексНомераТелефоновБуквенные.НомерТелефонаИндекс В(&БуквенныеНомера)";
	
	СоответствиеОбъектов = Новый Соответствие;
	
	Если Метаданные.Справочники.Найти("Партнеры")<>Неопределено Тогда
		СоответствиеОбъектов.Вставить("1", "Справочник.Партнеры");
	КонецЕсли; 
	Если Метаданные.Справочники.Найти("Контрагенты")<>Неопределено Тогда
		СоответствиеОбъектов.Вставить("2", "Справочник.Контрагенты");
	КонецЕсли; 
	Если Метаданные.Справочники.Найти("КонтактныеЛицаПартнеров")<>Неопределено Тогда
		СоответствиеОбъектов.Вставить("3", "Справочник.КонтактныеЛицаПартнеров");
	КонецЕсли; 
	Если Метаданные.Справочники.Найти("КонтактныеЛицаКонтрагентов")<>Неопределено Тогда
		СоответствиеОбъектов.Вставить("4", "Справочник.КонтактныеЛицаКонтрагентов");
	КонецЕсли;
	Если Метаданные.Справочники.Найти("КонтактныеЛица")<>Неопределено Тогда
		СоответствиеОбъектов.Вставить("5", "Справочник.КонтактныеЛица");
	КонецЕсли;
	Если Метаданные.Справочники.Найти("ФизическиеЛица")<>Неопределено Тогда
		СоответствиеОбъектов.Вставить("6", "Справочник.ФизическиеЛица");
	КонецЕсли; 
	
	ПолеПриоритет = "";
	ПолеПриоритетБуквенные = "";
	
	Для каждого СпрИсточник Из СоответствиеОбъектов Цикл
	
		ПолеПриоритет = ПолеПриоритет + "
		|		КОГДА МИКО_опИндексНомераТелефонов.СсылкаНаКлиента ССЫЛКА "+СпрИсточник.Значение+"
		|			ТОГДА "+СпрИсточник.Ключ;
		
		ПолеПриоритетБуквенные = ПолеПриоритетБуквенные + "
		|		КОГДА МИКО_опИндексНомераТелефоновБуквенные.СсылкаНаКлиента ССЫЛКА "+СпрИсточник.Значение+"
		|			ТОГДА "+СпрИсточник.Ключ;
	
	КонецЦикла; 
	
	Если ЗначениеЗаполнено(ПолеПриоритет) И ЗначениеЗаполнено(ПолеПриоритетБуквенные) Тогда
		ПолеПриоритет = "ВЫБОР"+ПолеПриоритет+"
		|	ИНАЧЕ 8
		|КОНЕЦ КАК Приоритет,";
		
		ПолеПриоритетБуквенные = "ВЫБОР"+ПолеПриоритетБуквенные+"
		|	ИНАЧЕ 8
		|КОНЕЦ КАК Приоритет,";
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ПолеПриоритет) И ЗначениеЗаполнено(ПолеПриоритетБуквенные) Тогда
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ПолеПриоритет//", ПолеПриоритет);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ПолеПриоритетБуквенные//", ПолеПриоритетБуквенные);
		
		Запрос.Текст = Запрос.Текст+"
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
		
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("ЧисловыеНомера", Числовые);
	Запрос.УстановитьПараметр("БуквенныеНомера", Буквенные);
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;	

КонецФункции // ОпределитьКонтактПоНомеруТелефона()

// Обновление информации по контактам в истории звонков. 
// Парамтры: 
//   Ссылка - ссылка на владельца контактной информции.
//   Буквенные - тип "массив" номера контактой информации тип "строка".
//   Числовые - тип "массив" номера контактой информации тип "число".
Процедура ОбновитьКонтактВИсторииЗвонков(Ссылка, Буквенные, Числовые, МВТ=Неопределено, КоличествоМесяцев=2)
	Запрос = Новый Запрос;
	Если МВТ=Неопределено Тогда
		МВТ = Новый МенеджерВременныхТаблиц;
		Запрос.МенеджерВременныхТаблиц = МВТ;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	МИКО_стЗаписьИсторииЗвонков.Src_ID КАК Src_ID,
			|	МИКО_стЗаписьИсторииЗвонков.Dst_ID КАК Dst_ID,
			|	МИКО_стЗаписьИсторииЗвонков.Src КАК Src,
			|	МИКО_стЗаписьИсторииЗвонков.Dst КАК Dst,
			|	МИКО_стЗаписьИсторииЗвонков.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ЗаписиИсторииЗвонковПериод
			|ИЗ
			|	Документ.МИКО_стЗаписьИсторииЗвонков КАК МИКО_стЗаписьИсторииЗвонков
			|ГДЕ
			|	МИКО_стЗаписьИсторииЗвонков.Дата > &ДатаГраницы
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Cidnum_ID,
			|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Peer_ID,
			|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Cidnum,
			|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Peer,
			|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка
			|ИЗ
			|	Документ.МИКО_стЗаписьИсторииЗвонков.ДетализацияCEL КАК МИКО_стЗаписьИсторииЗвонковДетализацияCEL
			|ГДЕ
			|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Eventtime > &ДатаГраницы
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	0,
			|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Dst_ID,
			|	"""",
			|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Dst,
			|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка
			|ИЗ
			|	Документ.МИКО_стЗаписьИсторииЗвонков.CDR_ПропустившиеЗвонок КАК МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок
			|ГДЕ
			|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Дата > &ДатаГраницы
			|";
		Запрос.УстановитьПараметр("ДатаГраницы", 	ДобавитьМесяц(ТекущаяДата(), (-1)*КоличествоМесяцев));
		Выборка = Запрос.Выполнить();                                                
	КонецЕсли; 
	
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	стЗаписьИсторииЗвонковДетализация.Ссылка
		|ИЗ
		|	ЗаписиИсторииЗвонковПериод КАК стЗаписьИсторииЗвонковДетализация
		|ГДЕ
		|	(стЗаписьИсторииЗвонковДетализация.Src_ID В (&ЧисловыеНомера)
		|			ИЛИ стЗаписьИсторииЗвонковДетализация.Dst_ID В (&ЧисловыеНомера))";
	Запрос.УстановитьПараметр("ЧисловыеНомера", Числовые);
	Если Буквенные.Количество()>0 Тогда
		Запрос.Текст = Запрос.Текст + "
			| ОБЪЕДИНИТЬ ВСЕ
			|ВЫБРАТЬ
			|	стЗаписьИсторииЗвонковДетализация.Ссылка
			|ИЗ
			|	ЗаписиИсторииЗвонковПериод КАК стЗаписьИсторииЗвонковДетализация
			|ГДЕ
			|	(стЗаписьИсторииЗвонковДетализация.Src В (&БуквенныеНомера)
			|			ИЛИ стЗаписьИсторииЗвонковДетализация.Dst В (&БуквенныеНомера))";			
		Запрос.УстановитьПараметр("БуквенныеНомера", Буквенные);
	КонецЕсли; 
	
	Результат = Запрос.Выполнить().Выгрузить(); 
	Результат.Свернуть("Ссылка");
	
	Для каждого Выборка Из Результат Цикл
				
		ОбъектДокумента = Неопределено;
		
		МассивПолей = Новый Массив;
		МассивПолейТаблицы = Новый Массив;                      
		
		ПравитьCEL = Ложь; 
		Если НЕ Числовые.найти(Выборка.Ссылка.Src_ID) = Неопределено
			 ИЛИ НЕ Буквенные.найти(Выборка.Ссылка.Src) = Неопределено Тогда
			// нужно править
			МассивПолей.Добавить("Src_Ссылка");
		КонецЕсли; 
		Если НЕ Числовые.найти(Выборка.Ссылка.Dst_ID) = Неопределено
			 ИЛИ НЕ Буквенные.найти(Выборка.Ссылка.Dst) = Неопределено Тогда
			// нужно править
			МассивПолей.Добавить("Dst_Ссылка");
		КонецЕсли;                                   
		
		ТаблицаCEL = Выборка.Ссылка.ДетализацияCEL.Выгрузить();
		Для каждого СтрокаCEL Из ТаблицаCEL Цикл
		                                                                               
			Если НЕ Числовые.найти(СтрокаCEL.Cidnum_ID) = Неопределено
				 ИЛИ НЕ Буквенные.найти(СтрокаCEL.Cidnum) = Неопределено Тогда
				// нужно править
				СтрокаCEL.Src_Ссылка = Ссылка;
				ПравитьCEL = Истина;
			КонецЕсли; 
			Если НЕ Числовые.найти(СтрокаCEL.Peer_ID) = Неопределено
				 ИЛИ НЕ Буквенные.найти(СтрокаCEL.Peer) = Неопределено Тогда
				// нужно править
				СтрокаCEL.Dst_Ссылка = Ссылка;
				ПравитьCEL = Истина;
			КонецЕсли;                                   
		КонецЦикла;
		
		CDR_ПропустившиеЗвонок = Выборка.Ссылка.CDR_ПропустившиеЗвонок.Выгрузить();
		Для каждого СтрПропустившего Из CDR_ПропустившиеЗвонок Цикл
			Если НЕ Числовые.найти(СтрПропустившего.Dst_ID) = Неопределено
				 ИЛИ НЕ Буквенные.найти(СтрПропустившего.Dst) = Неопределено Тогда
				// нужно править
				СтрПропустившего.Dst_Ссылка = Ссылка;              
				ПравитьПропустивших = Истина;                     
			КонецЕсли; 
		КонецЦикла;
		
		Если МассивПолей.Количество()>0
			 ИЛИ ПравитьCEL = Истина Тогда
			Попытка
				ОбъектДокумента = Выборка.Ссылка.ПолучитьОбъект();
			Исключение
				//
				Продолжить;
			КонецПопытки;  
			Для каждого ИмяПоля Из МассивПолей Цикл
			 	ОбъектДокумента[ИмяПоля] = Ссылка;
			КонецЦикла; 
			
			Если ПравитьCEL = Истина Тогда
			  	ОбъектДокумента.ДетализацияCEL.загрузить(ТаблицаCEL);
			КонецЕсли;
			Если ПравитьПропустивших = Истина Тогда
			  	ОбъектДокумента.CDR_ПропустившиеЗвонок.загрузить(CDR_ПропустившиеЗвонок);
			КонецЕсли; 
			
			Попытка
			   	ОбъектДокумента.Записать();
			Исключение
			   	// 
			КонецПопытки; 
		КонецЕсли; 
		
	КонецЦикла;

КонецПроцедуры// ОбновитьКонтактВИсторииЗвонков( Источник.Ссылка, Буквенные, Числовые)()

// Необходимо вызвать после записи справочника, содержащего телефон
// 
Процедура УниверсальноеЗаполнениеТелефоннойКниги(ОбъектСсылка,ВидКонтактнойИнформации, Представление) Экспорт
	
	НомерТелефона = МИКО_опЗаписьКИ.УбратьИзНомераТелефонаВсеПрефиксы(Представление, """' /*+=\,!;%:?()");
	КоличествоХранимыхЦифрТелефона = МИКО_стОбщегоНазначенияСерверПовторный.КоличествоХранимыхЦифрТелефона();
	Если НЕ ЗначениеЗаполнено(НомерТелефона) Тогда
		новЗапись = РегистрыСведений.МИКО_опИндексНомераТелефонов.СоздатьНаборЗаписей();
		новЗапись.Отбор.СсылкаНаКлиента.Установить(ОбъектСсылка);
		новЗапись.Записать();
		Возврат;
	КонецЕсли;
	
	Если МИКО_опЗаписьКИ.ЭтоЧисловойНомер(НомерТелефона) Тогда
		НомерТелефона = МИКО_опЗаписьКИ.УбратьИзНомераТелефонаВсеПрефиксы(НомерТелефона);
		
		новЗапись = РегистрыСведений.МИКО_опИндексНомераТелефонов.СоздатьМенеджерЗаписи();
		
		новЗапись.СсылкаНаКлиента = ОбъектСсылка;
		новЗапись.НомерТелефонаИндекс 	= МИКО_опЗаписьКИ.ПреобразоватьНомерДляСохранения(НомерТелефона, КоличествоХранимыхЦифрТелефона);
		новЗапись.НомерТелефонаСтрокой 	= МИКО_опЗаписьКИ.УбратьИзСтрокиТелефонаВсеБуквы(НомерТелефона);
		
		новЗапись.Записать();
	ИначеЕсли МИКО_опЗаписьКИ.ВСловеТолькоЛатиница(НомерТелефона) Тогда
		// Это скайп
		
		новЗапись = РегистрыСведений.МИКО_опИндексНомераТелефоновБуквенные.СоздатьМенеджерЗаписи();
		
		новЗапись.СсылкаНаКлиента = ОбъектСсылка;
		новЗапись.НомерТелефонаИндекс 	= СтрЗаменить(НомерТелефона," ","");
		новЗапись.НомерТелефонаСтрокой 	= СтрЗаменить(НомерТелефона," ","");
		
		новЗапись.Записать();
	КонецЕсли; 	
	
КонецПроцедуры

// Возвращает полное имя объекта метаданных по переданному значению ссылки.
// Примеры:
//  "Справочник.Номенклатура";
//  "Документ.ПриходнаяНакладная".
//
// Параметры:
//  Ссылка - ЛюбаяСсылка - объект, для которого необходимо получить имя таблицы ИБ.
// 
// Возвращаемое значение:
//  Строка - полное имя объекта метаданных для указанного объекта.
//
Функция ИмяТаблицыПоСсылке(Ссылка) Экспорт
	
	Возврат Ссылка.Метаданные().ПолноеИмя();
	
КонецФункции

// Подмена формы истории звонков на форму журнала статистики.
// 
Функция ИспользоватьЖурналСтатистикиВПанели() Экспорт
	Попытка
		врИспользовать = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ИспользоватьЖурналСтатистикиВПанелиТелефонии();
	Исключение
	   	врИспользовать = Ложь;	
	КонецПопытки; 
	Возврат (врИспользовать=Истина);	
КонецФункции // ИспользоватьЖурналСтатистикиВ_PT1C()

// УДАЛИТЬ Вместе с подпиской на событие "МИКО_мвСправочникПользователиПриЗаписи"
Процедура СправочникСКонтактамиПриЗаписи(Источник, Отказ) Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

// #КонецОбласти
